backend/src/scripts/loadTest.yml
config:
  target: "http://localhost:5000"
  phases:
    - duration: 30
      arrivalRate: 2
      name: "Fase de calentamiento"
    - duration: 60
      arrivalRate: 5
      name: "Fase de carga"
    - duration: 30
      arrivalRate: 8
      name: "Fase de estrés"

scenarios:
  - name: "Consulta de estado de aforo"
    flow:
      - get:
          url: "/api/acceso/estado"